app/views/messages/_sidebar.html.haml

SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 3
---
    .group
      - current_user.groups.each do |group|