app/views/messages/create.json.jbuilder

json.image  @message.image.url
json.date @message.created_at.strftime("%Y年%m月%d日 %H時%M分")
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'bird-3183441__480.jpg', 45, 3, '2018-04-07 11:04:48', '2018-04-07 11:04:48')